In [3]:
import pandas as pd

## 1.CREATE
Using a dictionary of multiple series to create a dataframe

In [5]:
#Creating the dictionary
empdict = {
    "EmpID" : pd.Series([1,2,3,4,5,6]),
    "Name" : pd.Series(["Harsh","Rajat","Ekta","Mayur","Oorjit","Sashank"]),
    "EmailID": pd.Series(["harsh@gmail.com","Rajat@gmail.com","Ekta@gmail.com","Mayur@gmail.com","Oorjit@gmail.com","Sashank@gmail.com",]),
    "Age": pd.Series([19,24,34,49,23,25])
}

In [7]:
#Creating the DataFrame
df = pd.DataFrame(empdict)

## 2.READ
### Note:
#### 1.loc(): it is location by label
#### 2.iloc(): it is location by integer index

In [9]:
print(df)

   EmpID     Name            EmailID  Age
0      1    Harsh    harsh@gmail.com   19
1      2    Rajat    Rajat@gmail.com   24
2      3     Ekta     Ekta@gmail.com   34
3      4    Mayur    Mayur@gmail.com   49
4      5   Oorjit   Oorjit@gmail.com   23
5      6  Sashank  Sashank@gmail.com   25

In [10]:
df

   EmpID     Name            EmailID  Age
0      1    Harsh    harsh@gmail.com   19
1      2    Rajat    Rajat@gmail.com   24
2      3     Ekta     Ekta@gmail.com   34
3      4    Mayur    Mayur@gmail.com   49
4      5   Oorjit   Oorjit@gmail.com   23
5      6  Sashank  Sashank@gmail.com   25

In [29]:
df.loc[[0,2]]

   EmpID  EmpNo   Name          EmailID  Age  Experience
0      1      0  Harsh  harsh@gmail.com   19           1
2      3      2   Ekta   Ekta@gmail.com   34          10

In [30]:
df.loc[0:2]

   EmpID  EmpNo   Name          EmailID  Age  Experience
0      1      0  Harsh  harsh@gmail.com   19           1
1      2      1  Rajat  Rajat@gmail.com   24           3
2      3      2   Ekta   Ekta@gmail.com   34          10

In [32]:
df.iloc[0,2]

'Harsh'

In [33]:
df.iloc[1,3]

'Rajat@gmail.com'

# 3.UPDATE
### Note:
#### 1. insert(): this function only adds columns, it cannot be used to add rows to the df.
#### 2. loc is used for inserting a row since it is location by label, hence a new row can be inserted using this
#### 3. iloc is only used for modifying/accessing elements, it cannot add an element to a position in a new row or column.

In [73]:
exp = [1,3,10,20,2,4]
df.insert(4,"Experience", exp)

In [74]:
df

   EmpID  EmpNo     Name            EmailID  Experience  Age
a      1      0    Harsh    harsh@gmail.com           1   19
b      2      1    Rajat    Rajat@gmail.com           3   24
c      3      2     Ekta     Ekta@gmail.com          10   34
d      4      3    Mayur    Mayur@gmail.com          20   49
f      6      5  Sashank  Sashank@gmail.com           2    5
g      7      6    Nitin    nitin@gmail.com           4   50

In [76]:
new_row = [7,"Nitin","nitin@gmail.com",50,20]
df.loc[len(df)] = new_row

In [77]:
df.insert(1,"EmpNo",0) 
df["EmpNo"] = df["EmpID"]-1

#### Added Columns EmpNo and Experience

In [78]:
df

   EmpID  EmpNo     Name            EmailID  Experience  Age
a      1      0    Harsh    harsh@gmail.com           1   19
b      2      1    Rajat    Rajat@gmail.com           3   24
c      3      2     Ekta     Ekta@gmail.com          10   34
d      4      3    Mayur    Mayur@gmail.com          20   49
f      6      5  Sashank  Sashank@gmail.com           2    5
g      7      6    Nitin    nitin@gmail.com           4   50

## 4.DELETE

### Note:
#### 1.An element at a particular position in the dataframe cannot be deleted, value can be marked Nan via numpy. It can be deleted in series by using drop though.
#### 2.Rows and Columns can be deleted by using drop, axis=0 is for rows and axis=1 is for columns. 
#### 3. del and .pop() functions are used only for removing columns from the dataframe.

In [79]:
EmpNo = df.pop("EmpNo")

In [80]:
EmpNo

a    0
b    1
c    2
d    3
f    5
g    6
Name: EmpNo, dtype: int64

In [81]:
df

   EmpID     Name            EmailID  Experience  Age
a      1    Harsh    harsh@gmail.com           1   19
b      2    Rajat    Rajat@gmail.com           3   24
c      3     Ekta     Ekta@gmail.com          10   34
d      4    Mayur    Mayur@gmail.com          20   49
f      6  Sashank  Sashank@gmail.com           2    5
g      7    Nitin    nitin@gmail.com           4   50

In [82]:
del df["Experience"]

In [83]:
df

   EmpID     Name            EmailID  Age
a      1    Harsh    harsh@gmail.com   19
b      2    Rajat    Rajat@gmail.com   24
c      3     Ekta     Ekta@gmail.com   34
d      4    Mayur    Mayur@gmail.com   49
f      6  Sashank  Sashank@gmail.com    5
g      7    Nitin    nitin@gmail.com   50

In [85]:
x = df.iloc[5,3]

In [86]:
x

np.int64(50)

In [88]:
df.index = ["a","b","c","d","e","f"]

In [89]:
df

   EmpID     Name            EmailID  Age
a      1    Harsh    harsh@gmail.com   19
b      2    Rajat    Rajat@gmail.com   24
c      3     Ekta     Ekta@gmail.com   34
d      4    Mayur    Mayur@gmail.com   49
e      6  Sashank  Sashank@gmail.com    5
f      7    Nitin    nitin@gmail.com   50

In [90]:
df.drop("e",inplace = True)

In [91]:
df

   EmpID   Name          EmailID  Age
a      1  Harsh  harsh@gmail.com   19
b      2  Rajat  Rajat@gmail.com   24
c      3   Ekta   Ekta@gmail.com   34
d      4  Mayur  Mayur@gmail.com   49
f      7  Nitin  nitin@gmail.com   50